[
  {
    "id": 1,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/img2.jpg",
    "title_tr": "Hasbunallahu ve Ni'mel Vekil",
    "title_en": "Allah is Sufficient for Us",
    "theme_tr": "TEVEKKÜL",
    "theme_en": "TRUST",
    "text_ar": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ نِعْمَ الْمَوْلَى وَنِعْمَ النَّصِيرُ",
    "translation_tr": "Allah bize yeter, O ne güzel vekildir. O ne güzel dost ve ne güzel yardımcıdır.",
    "translation_en": "Allah is sufficient for us, and He is the best Disposer of affairs. What an excellent Protector and Helper."
  },
  {
    "id": 2,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/img3.jpg",
    "title_tr": "Bismillahillezi...",
    "title_en": "In the Name of Allah...",
    "theme_tr": "KORUNMA",
    "theme_en": "PROTECTION",
    "text_ar": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation_tr": "İsmiyle yerde ve gökte hiçbir şeyin zarar veremeyeceği Allah'ın adıyla. O, hakkıyla işitendir, hakkıyla bilendir.",
    "translation_en": "In the name of Allah, with Whose name nothing on earth or in the heaven can cause any harm. He is the All-Hearing, All-Knowing."
  },
  {
    "id": 3,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/img1.jpg",
    "title_tr": "Rabbena Atina",
    "title_en": "Our Lord, Grant Us",
    "theme_tr": "DÜNYA VE AHİRET",
    "theme_en": "WORLD & HEREAFTER",
    "text_ar": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "translation_tr": "Rabbimiz! Bize dünyada da iyilik ver, ahirette de iyilik ver. Bizi cehennem azabından koru.",
    "translation_en": "Our Lord, give us in this world that which is good and in the Hereafter that which is good and protect us from the punishment of the Fire."
  },
  {
    "id": 4,
     "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/img2.jpg",
    "title_tr": "Rabbenağfirli",
    "title_en": "Our Lord, Forgive Me",
    "theme_tr": "BAĞIŞLANMA",
    "theme_en": "FORGIVENESS",
    "text_ar": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "translation_tr": "Rabbimiz! Hesap görülecek günde beni, ana-babamı ve müminleri bağışla.",
    "translation_en": "Our Lord, forgive me and my parents and the believers on the Day the account is established."
  },
  {
    "id": 5,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/imgage2.jpg",
    "title_tr": "Seyyidü’l İstiğfar",
    "title_en": "The Master Supplication for Forgiveness",
    "theme_tr": "SABAH DUALARI",
    "theme_en": "MORNING PRAYERS",
    "text_ar": "عُوذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيمِ، اللّٰهُمَّ أَنْتَ رَبِّي، لَا إِلٰهَ إِلَّا أَنْتَ خَلَقْتَـنِي، وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "translation_tr": "Kovulmuş şeytanın şerrinden Allah’a sığınırım. Rahman ve Rahîm Allah’ın adıyla. Allahım! Sen benim Rabbimsin; Senden başka ilah yoktur. Beni Sen yarattın. Ben Senin kulunum ve gücüm yettiğince Sana olan ahdime ve vaadime bağlıyım. İşlediklerimin şerrinden Sana sığınırım. Üzerimdeki nimetlerini itiraf eder, günahlarımı da kabul ederim. Beni bağışla; zira günahları sadece Sen bağışlarsın.",
    "translation_en": "O Allah, You are my Lord, none has the right to be worshipped except You. You created me and I am Your servant..."
  },
  {
    "id": 6,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/imgage3.jpg",
    "title_tr": "İmanda Sıhhat Duası",
    "title_en": "Supplication for Sound Faith",
    "theme_tr": "İMAN VE RIZA",
    "theme_en": "FAITH & CONTENTMENT",
    "text_ar": "اَللّٰهُمَّ إِنِّي أَسْأَلُكَ صِحَّةً فِي إِيمَانٍ، وَإِيمَانًا فِي حُسْنِ خُلُقٍ، وَنَجَاحًا يَتْبَعُهُ فَلَاحٌ، وَرَحْمَةً مِنْكَ وَعَافِيَةً، وَمَغْفِرَةً مِنْكَ وَرِضْوَانًا",
    "translation_tr": "Allahım! Senden, imanda sıhhat, güzel ahlakla bezenmiş iman, arkasından felah gelecek bir muvaffakiyet, katından rahmet ve afiyet ve nezdinden mağfiret ve rıza diliyorum.",
    "translation_en": "O Allah, I ask You for sound faith, faith adorned with good character, success followed by salvation, mercy and well-being from You, and forgiveness and pleasure from You."
  },
  {
    "id": 7,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/imgage1.jpg",
    "title_tr": "İmanı Sevdir Duası",
    "title_en": "Make Faith Beloved to Us",
    "theme_tr": "HİDAYET",
    "theme_en": "GUIDANCE",
    "text_ar": "اَللّٰهُمَّ حَبِّبْ إِلَيْنَا الْإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ",
    "translation_tr": "Allahım! İmanı bize sevdir ve onu kalblerimizde tezyin et. Küfür, fısk ve isyanı da bize çirkin göster ve bizi hep dosdoğru yolda yürüyenlerden eyle.",
    "translation_en": "O Allah, make faith beloved to us and beautify it in our hearts. Make disbelief, wickedness and disobedience hateful to us and make us among the rightly guided."
  }
]
