[
  {
  "id": 1,
  "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/regaib.jpg",
  "theme_tr": "REGAİB KANDİLİ",
  "theme_en": "LAYLAT AL-RAGHAIB",
  "title_tr": "Regaib Kandili",
  "title_en": "What can be said about the significance of the Night of Raghaib based on Bediüzzaman Said Nursi’s view that it marks the beginning of the Prophet Muhammad’s spiritual ascent?",
  "text_ar": "Allah’ım ne olur ümmet-i Muhammed’e hayırlar ihsan eyle! Allah’ım ne olur ümmet-i Muhammed’i içine düştüğü bu sefalet ve zelillikten halas eyle! Nam-ı Celil-i İlâhiyî her yerde dalgalandır!",
  "translation_tr": "Soru: Bediüzzaman Hazretleri Regaib gecesinin Zat-ı Ahmediye’nin (sallallahu aleyhi ve sellem) manevi terakkisinin başlangıcı, Miraç gecesinin de O’nun zirveye ulaşmasının ünvanı olduğunu söylüyor. Onun bu sözlerinden hareketle Regaib gecesinin önemiyle ilgili neler söylenebilir?\n\nCevap: Hazreti Bediüzzaman bu tespiti büyük ihtimalle manevi müşahede ve mükâşefesine dayanarak yapmıştır. Tarihî kaynaklar açısından bakıldığında bu sözün temel manasını kavramak zor olabilir. Bazı rivayetlerde Peygamber Efendimiz’in bu gecede anne karnına düştüğü ifade edilse de bu tarihî olarak doğru değildir. Bu sebeple bazı âlimler Hazreti Âmine’nin bu gecede hamile olduğunu fark etmiş olabileceğini söylemişlerdir; ancak bunu doğrulayan sahih bir rivayet yoktur.\n\nBediüzzaman’ın yaklaşımına göre Regaib gecesi, Efendimiz’in Allah’a yönelerek manevi yolculuğuna başladığı, peygamberliğe hazırlandığı ve Miraca uygun bir manevi donanım kazanmaya yöneldiği bir başlangıç noktası olarak değerlendirilebilir. Bu süreç Efendimiz’in manevi hayatında adeta ikinci bir doğuş olarak görülebilir. Daha sonra bu istidat ilahi rehberlikle zirveye taşınmış ve Miraç’la taçlandırılmıştır.\n\nÜç aylar ve bu aylardaki mübarek geceler, yapılan ibadetlerin bereketinin kat kat arttığı zaman dilimleridir. Regaib gecesi de bu yönüyle diğer gecelere göre ayrı bir kıymete sahiptir. Bu gecelerde yapılan ibadetler, kişinin istidadına göre daha fazla sevap ve manevi kazanç getirir.",
  "translation_en": "Question: Bediüzzaman Said Nursi states that the Night of Raghaib marks the beginning of the spiritual ascent of the Person of Ahmad (peace and blessings be upon him), while the Night of Mi‘raj signifies the culmination of this ascent. Based on these words, what can be said about the significance of the Night of Raghaib?\n\nAnswer: Bediüzzaman most likely made this assessment based on his spiritual insight and inner perception. When viewed purely from a historical perspective, it may be difficult to fully grasp the essence of this statement. Although some reports suggest that the Prophet Muhammad (peace and blessings be upon him) was conceived on this night, such claims are not historically accurate. Some scholars therefore suggested that his mother, Lady Aminah, may have become aware of her pregnancy on this night; however, there is no authentic narration confirming this view.\n\nFrom Bediüzzaman’s perspective, the Night of Raghaib may be understood as the moment when the Prophet turned toward God with deep longing, began his spiritual journey, and entered a period of preparation for prophethood, gradually acquiring the spiritual readiness necessary for the Mi‘raj. In this sense, it can be regarded as a second birth and a new beginning in his spiritual life. This latent potential was later perfected through divine guidance and ultimately crowned with the Mi‘raj.\n\nThe sacred months and their blessed nights are times when the rewards of worship are greatly multiplied. In this respect, the Night of Raghaib holds a distinct value among other nights. Acts of worship performed during such times gain increased depth and blessing, and each believer benefits from them according to their own spiritual capacity."
},
  {
    "id": 2,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image2.jpg",
    "theme_tr": "TEVEKKÜL",
    "theme_en": "TRUST",
    "title_tr": "Hasbunallahu ve Ni'mel Vekil",
    "title_en": "Allah is Sufficient for Us",
    "text_ar": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ نِعْمَ الْمَوْلَى وَنِعْمَ النَّصِيرُ",
    "translation_tr": "Allah bize yeter, O ne güzel vekildir. O ne güzel dost ve ne güzel yardımcıdır.",
    "translation_en": "Allah is sufficient for us, and He is the best Disposer of affairs. What an excellent Protector and Helper."
  },
  {
    "id": 3,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image4.jpg",
    "theme_tr": "KORUNMA",
    "theme_en": "PROTECTION",
    "title_tr": "Bismillahillezi...",
    "title_en": "In the Name of Allah...",
    "text_ar": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "translation_tr": "İsmiyle yerde ve gökte hiçbir şeyin zarar veremeyeceği Allah'ın adıyla. O, hakkıyla işitendir, hakkıyla bilendir.",
    "translation_en": "In the name of Allah, with Whose name nothing on earth or in the heaven can cause any harm. He is the All-Hearing, All-Knowing."
  },
  {
    "id": 4,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image5.jpg",
    "theme_tr": "DÜNYA VE AHİRET",
    "theme_en": "WORLD & HEREAFTER",
    "title_tr": "Rabbena Atina",
    "title_en": "Our Lord, Grant Us",
    "text_ar": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "translation_tr": "Rabbimiz! Bize dünyada da iyilik ver, ahirette de iyilik ver. Bizi cehennem azabından koru.",
    "translation_en": "Our Lord, give us in this world that which is good and in the Hereafter that which is good and protect us from the punishment of the Fire."
  },
  {
    "id": 5,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image1.jpg",
    "theme_tr": "BAĞIŞLANMA",
    "theme_en": "FORGIVENESS",
    "title_tr": "Rabbenağfirli",
    "title_en": "Our Lord, Forgive Me",
    "text_ar": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
    "translation_tr": "Rabbimiz! Hesap görülecek günde beni, ana-babamı ve müminleri bağışla.",
    "translation_en": "Our Lord, forgive me and my parents and the believers on the Day the account is established."
  },
  {
    "id": 6,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image2.jpg",
    "theme_tr": "NAMAZ",
    "theme_en": "PRAYER",
    "title_tr": "Ettehiyyatü",
    "title_en": "At-Tahiyyat",
    "text_ar": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَواتُ وَالطَّيِّباتُ السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكاتُهُ السَّلامُ عَلَيْنا وَعَلَى عِبادِ اللَّهِ الصَّالِحينَ",
    "translation_tr": "Dil, beden ve mal ile yapılan bütün ibadetler Allah'adır. Ey Peygamber! Allah'ın selamı, rahmet ve bereketi senin üzerine olsun.",
    "translation_en": "All compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings."
  },
  {
    "id": 7,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image4.jpg",
    "theme_tr": "GÜNLÜK ADAP",
    "theme_en": "DAILY ADAB",
    "title_tr": "Tuvalete Girerken",
    "title_en": "Entering the Toilet",
    "text_ar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
    "translation_tr": "Allah'ım! Pislikten ve cinlerin şerrinden sana sığınırım.",
    "translation_en": "O Allah, I seek refuge with You from all offensive and wicked things (evil spirits)."
  },
  {
    "id": 8,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image3.jpg",
    "theme_tr": "GÜNLÜK ADAP",
    "theme_en": "DAILY ADAB",
    "title_tr": "Tuvaletten Çıkarken",
    "title_en": "Leaving the Toilet",
    "text_ar": "غُفْرَانَكَ",
    "translation_tr": "Allah'ım senin bağışlamanı dilerim.",
    "translation_en": "I ask You (Allah) for forgiveness."
  },
  {
    "id": 9,
    "image_url": "https://raw.githubusercontent.com/Recep-T/ios-json-api/main/src/assets/image1.jpg",
    "theme_tr": "KOLAYLIK",
    "theme_en": "EASE",
    "title_tr": "Rabbi Yessir",
    "title_en": "Rabbi Yessir",
    "text_ar": "رَبِّ يَسِّرْ وَلَا تُعَسِّرْ رَبِّ تَمِّمْ بِالْخَيْرِ",
    "translation_tr": "Rabbim! Kolaylaştır, zorlaştırma. Rabbim, hayırla tamamla.",
    "translation_en": "My Lord, make it easy and do not make it difficult. My Lord, let it be completed with goodness."
  }
]
